//: [Previous](@previous)

/*:
### 의사코드
의사코드를 메모장에 적어내려가는 과정을 거쳤다. 그 중 random이라는 것도 알게 되고..! 특정한 범위 내에서 무작위로 숫자를 뽑아주는 유용한 친구다. 의사코드 작성도 너무 간단한 것 같아서 수정을 한번 거쳤다.
1) Set 선언
2) set.count 가 6개가 될 때까지 1_45 사이의 랜덤한 숫자 생성 후 추가
3) Set 형태로 값 반환
에서

1. Set 선언
2. While 문 시작 set.count가 6개 이하인가?
    1. Yes -> 1_45 사이의 랜덤한 숫자 생성 후 set에 추가
    2. No -> while 문 끝.
3. Set 형태로 값 반환
이렇게!

둘 다 너무 간단한 것 같아서 이게 맞나 싶지만... PR을 보내 놓았으니 내일 관련된 의견을 들어볼 수 있겠지!

### 문제의 해석
step1 문제를 해석하면서 조금 에러가 있었다. 문제에서 collection 타입 중 하나의 형태로 값을 반환하라고 되어 있는데 이게 뭘 말하는지 잘 모르겠다. 단순히 출력,, 혹은 return을 쓰면 되는 걸까?

### 최악의 하루
열이 너무 나서 머리가 잘 안돌아간다. step2 전까지의 모든 내용을 공부해놓고 싶었는데.. 내일로 미루기 진짜 싫은데 도저히 안되겠다. 너무너무너무 아프다... 주말부터 아프길래 쉬었는데도 심해지기만 하는 것 같아 속상하다.
*/
 
//: [Next](@next)
