import UIKit

/*:
 ## ot
 오늘 저녁에는 시간을 내기가 어려워서 영상으로 들었다. 이것저것 많은 말씀들을 해주셨는데, 질문을 해야한다는 것과 그 전에 직접 깊이 많이 생각해봐야 한다는 것이 기억에 남는다. 코딩과 관련해서가 아니더라도 그동안 조금만 어려우면 바로 선생님을 찾거나 구글 검색 혹은 알 것 같은 사람에게 묻는게 습관이 되어 있었는데, 스스로 생각해보는 시간을 더 가져야겠다. 그것이 지금 내게 필요한 부분 중 하나 인 것 같다.

 ## git
 week1에서 올라온 것 중 git에 대한 글들을 읽어보았다. 그동안 git에 대해 많은 이야기들을 들었고 누군가를 따라 사용해본 적도 있지만 사실 온전하게 이해가 가진 않았다. 그래서 git이 뭔데, github이랑은 뭐가 다른건데, 왜 초기화하고 터미널에서 git을 어떻게 쓰는 건데,,,와 같은 질문들이 맴돌았던 것 같다.

 __하나의 연결된 선에서__ 원하는 버전, 커밋으로 언제든 돌아올 수 있다.

 git = 버전 관리 중인 git 파일을 **내 컴퓨터**에 저장.
 github = 관리 중인 git 파일을 **서버**에 저장.
 branch = 기본을 그대로 두고 버전을 여러개로 나누는 느낌. 여러 사람이 동시에 작업 가능하게 해주고 개인이 다양한 시도를 해볼 수 있게 해줌.

 ## terminal
 mac을 쓰는 만큼 terminal 도 몇 번 사용해 본 적이 있다. cd, ls, mkdir, cat, touch 등이 생각난다. 근데 git 연결되는게 뭔가 git에서 어떻게 해서 하는 줄 알았는데 아니었다! 그냥 내 컴퓨터에 저장하는 거라 일단 git에 넣고 나중에 git hub에 저장하면 그때 서버와 연결해서 하는 것 같다. 새로운 발견!
 */

//: [Next](@next)
